Autodesk.Revit.Exceptions.ModificationOutsideTransactionException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.ModificationOutsideTransactionException
The exception that is thrown by the undo transaction framework when the modification operation to the model is outside of a transaction.